In [1]:
import pandas as pd

In [2]:
titles = pd.read_csv('cast.csv')
titles.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [3]:
#Number of movies in titles dataframe
titles['title'].nunique()

172294

### What are the earliest two films listed in the titles dataframe?

In [33]:
df=titles[['title','year']].drop_duplicates().sort_values('year')
film1 = df['title'].iloc[:1,].item()
film2 = df['title'].iloc[1:2,].item()
print(f'The two films are: "{film1}" and "{film2}"')

The two films are: "Miss Jerry" and "Soldiers of the Cross"

### How many movies have the title "Hamlet"?

In [36]:
title_cnt = titles['Hamlet' == titles['title']]['title'].count()
print(f'Number of movies having the title "Hamlet" is: {title_cnt}')

Number of movies having the title Hamlet is: 313

### How many movies are titled "North by Northwest"?

In [37]:
title_cnt = titles['North by Northwest' == titles['title']]['title'].count()
print(f'Number of movies having the title "North by Northwest" is: {title_cnt}')

Number of movies having the title "North by Northwest" is: 112

### When was the first movie titled "Hamlet" made?

In [40]:
fst_mv = titles[titles['title']=='Hamlet']['year'].sort_values().iloc[:1].item()
print(f'First movie titled "Hamlet" was made on: {fst_mv} ')

First movie titled "Hamlet" was made on: 1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [43]:
print('List of all the "Treasure Island" movies from the earliest to the most recent:')
titles[titles['title']=='Treasure Island'][['title','year']].drop_duplicates().sort_values('year')

List of all the "Treasure Island" movies from the earliest to the most recent:

                  title  year
339256  Treasure Island  1918
374597  Treasure Island  1920
9432    Treasure Island  1934
13253   Treasure Island  1950
42039   Treasure Island  1972
523169  Treasure Island  1973
16246   Treasure Island  1985
114904  Treasure Island  1999

### How many movies were made in the year 1950?

In [50]:
cnt = titles[titles['year']==1950]['title'].drop_duplicates().count()
print(f'Number of movies made in the year of 1950 was: {cnt}')

Number of movies made in the year of 1950 is: 907

### How many movies were made in the year 1960?

In [51]:
cnt = titles[titles['year']==1960]['title'].drop_duplicates().count()
print(f'Number of movies made in the year of 1960 was: {cnt}')

Number of movies made in the year of 1960 is: 1088

### How many movies were made from 1950 through 1959?

In [52]:
cnt = titles[(titles['year']>=1950) & (titles['year']<1960)]['title'].drop_duplicates().count()
print(f'Number of movies made from 1950 through 1959 was: {cnt}')

Number of movies made from 1950 through 1959 are: 10091

### In what years has a movie titled "Batman" been released?

In [54]:
yrs = titles[titles['title']=='Batman']['year'].drop_duplicates().sort_values().tolist()
print(f'Movie titled "Batman" was released in : {yrs}')

Movie titled "Batman" was released in : [1943, 1989]

### How many roles were there in the movie "Inception"?

In [66]:
roles = titles[titles['title']=='Inception']['character'].drop_duplicates().tolist()
print(f'Number of roles in Inception movie was: {len(roles)}')

Number of roles in Inception movie is: 55

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [73]:
na_cnt = titles[(titles['title']=='Inception') & (titles['n'].isnull())]['character'].drop_duplicates().count()
print(f'Number of roles not ranked in "Inception" movie are: {na_cnt}')

Number of roles not ranked in "Inception" movie are: 36

### But how many roles in the movie "Inception" did receive an "n" value?

In [77]:
na_cnt = titles[(titles['title']=='Inception') & (titles['n'].notnull())]['character'].drop_duplicates().count()
print(f'Number of roles ranked in "Inception" movie are: {na_cnt}')

Number of roles ranked in "Inception" movie are: 36

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [88]:
pd.set_option('display.max_rows',120)
titles[titles['title']=='North by Northwest'][['name','n']].drop_duplicates().sort_values('n').reset_index(drop=True)

                     name     n
0              Cary Grant   1.0
1         Eva Marie Saint   2.0
2             James Mason   3.0
3     Jessie Royce Landis   4.0
4          Leo G. Carroll   5.0
5    Josephine Hutchinson   6.0
6             Philip Ober   7.0
7           Martin Landau   8.0
8           Adam Williams   9.0
9            Edward Platt  10.0
10      Robert Ellenstein  11.0
11           Les Tremayne  12.0
12        Philip Coolidge  13.0
13          Patrick McVey  14.0
14           Edward Binns  15.0
15              Ken Lynch  16.0
16          Stanley Adams   NaN
17             Andy Albin   NaN
18           Don Anderson   NaN
19        Ernest Anderson   NaN
20      Malcolm Atterbury   NaN
21              Tol Avery   NaN
22             Sam Bagley   NaN
23            Frank Baker   NaN
24          Baynes Barron   NaN
25          Brandon Beach   NaN
26          John Beradino   NaN
27        Stephen Bolster   NaN
28       Steve Carruthers   NaN
29          Taggart Casey   NaN
30          Bill Catching   NaN
31           Bob (II) Coe   NaN
32           David A. Cox   NaN
33             Walter Coy   NaN
34            Jimmy Cross   NaN
35              Jack Daly   NaN
36            John Damler   NaN
37        Lawrence Dobkin   NaN
38        Alphonso DuBois   NaN
39          Tommy Farrell   NaN
40        Adolph Faylauer   NaN
41             Paul Genge   NaN
42              Ned Glass   NaN
43         James Gonzalez   NaN
44           Tom Greenway   NaN
45          Robert Haines   NaN
46            Stuart Hall   NaN
47             Len Hendry   NaN
48       Alfred Hitchcock   NaN
49          Stuart Holmes   NaN
50          Hideo Inamura   NaN
51         Eugene Jackson   NaN
52          Bobby Johnson   NaN
53         Dick Johnstone   NaN
54               Sid Kane   NaN
55         Kenner G. Kemp   NaN
56            Colin Kenny   NaN
57         Larry Leverett   NaN
58       Carl M. Leviness   NaN
59     Alexander Lockwood   NaN
60          Frank Marlowe   NaN
61     Tom (III) Marshall   NaN
62          Thomas Martin   NaN
63        James McCallion   NaN
64        Carl Milletaire   NaN
65            Hans Moebus   NaN
66          Howard Negley   NaN
67          Monty O'Grady   NaN
68          Henry O'Neill   NaN
69         Murray Pollack   NaN
70         Charles Postal   NaN
71             Hugh Pryor   NaN
72             Ralph Reed   NaN
73               John Roy   NaN
74            Cosmo Sardo   NaN
75          Jeffrey Sayre   NaN
76           Scott Seaton   NaN
77          Harry Seymour   NaN
78          Robert Shayne   NaN
79           Jeremy Slate   NaN
80             Olan Soule   NaN
81        Harvey Stephens   NaN
82           Bert Stevens   NaN
83           Harry Strang   NaN
84         Joe Szorentini   NaN
85            Paul Togawa   NaN
86           Arthur Tovey   NaN
87        Dale Van Sickel   NaN
88             Ray Weaver   NaN
89           Frank Wilcox   NaN
90    Lloyd (VI) Williams   NaN
91        Robert Williams   NaN
92            Wilson Wood   NaN
93         Carleton Young   NaN
94       Ernesto Zambrano   NaN
95     Anne (II) Anderson   NaN
96         Lucille Curtis   NaN
97         Patricia Cutts   NaN
98            Jesslyn Fax   NaN
99           Bess Flowers   NaN
100    Josephine Forsberg   NaN
101          Sally Fraser   NaN
102         Madge Kennedy   NaN
103           Doreen Lang   NaN
104          Nora Marlowe   NaN
105       Maura McGiveney   NaN
106       Maudie Prickett   NaN
107           Doris Singh   NaN
108          Helen Spring   NaN
109         Susan Whitney   NaN
110        Paula Winslowe   NaN

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [89]:
titles[(titles['title']=='Sleuth') & (titles['year']==1972)][['name','n']].drop_duplicates().sort_values('n').reset_index(drop=True)

                 name    n
0    Laurence Olivier  1.0
1       Michael Caine  2.0
2      Alec Cawthorne  3.0
3  John (II) Matthews  4.0
4  Eve (III) Channing  5.0
5        Teddy Martin  6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [90]:
titles[(titles['title']=='Sleuth') & (titles['year']==2007)][['name','n']].drop_duplicates().sort_values('n').reset_index(drop=True)

                  name    n
0        Michael Caine  1.0
1             Jude Law  2.0
2        Harold Pinter  3.0
3      Kenneth Branagh  NaN
4  Alec (II) Cawthorne  NaN
5    Eve (II) Channing  NaN
6    Carmel O'Sullivan  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [102]:
df =titles[(titles['title']=='Hamlet') & (titles['year']==1921)][['character','n']].drop_duplicates().sort_values('n').reset_index(drop=True)
print(f'Number of roles credited in 1921 version of Hamlet is: {len(df)}')
df

Number of roles credited in 1921 version of Hamlet is: 9

          character    n
0            Hamlet  1.0
1      K?nig Hamlet  2.0
2  K?nigin Gertrude  3.0
3          Claudius  4.0
4           Horatio  5.0
5          Polonius  6.0
6           Laertes  7.0
7           Ophelia  8.0
8       Fortinbras,  9.0

### How many roles were credited in Branagh’s 1996 Hamlet?

In [104]:
pd.set_option('display.max_rows',25)
df =titles[(titles['title']=='Hamlet') & (titles['year']==1996)][['character','n']].drop_duplicates().sort_values('n').reset_index(drop=True)
print(f'Number of roles credited in 1921 version of Hamlet is: {len(df)}')
df

Number of roles credited in 1921 version of Hamlet is: 54

                   character    n
0      Attendant to Claudius  1.0
1         English Ambassador  2.0
2      Attendant to Claudius  3.0
3   Ghost of Hamlet's Father  4.0
4                     Hamlet  5.0
..                       ...  ...
49         Elsinore Courtier  NaN
50                   Pyrrhus  NaN
51                   Boatman  NaN
52                 Alexander  NaN
53                Prostitute  NaN

[54 rows x 2 columns]

### How many "Hamlet" roles have been listed in all film credits through history?

In [110]:
cred = titles[titles['character']=='Hamlet']['n'].drop_duplicates().count()
print(f'Number of "Hamlet" roles listed in all the film credits through history: {cred} ')

Number of "Hamlet" roles listed in all the film credits through history: 22

### How many people have played an "Ophelia"?

In [157]:
n = titles[titles['character']=='Ophelia']['name'].drop_duplicates().count()
print(f'Number of people played an "Ophelia" is: {n} ')

Number of people played an "Ophelia" is: 109

### How many people have played a role called "The Dude"?

In [158]:
n = titles[titles['character']=='The Dude']['name'].drop_duplicates().count()
print(f'Number of people played "The Dude" character is: {n} ')

Number of people played "The Dude" character is: 18

### How many people have played a role called "The Stranger"?

In [159]:
n = titles[titles['character']=='The Stranger']['name'].drop_duplicates().count()
print(f'Number of people played "The Stranger" role is: {n} ')

Number of people played "The Stranger" role is: 197

### How many roles has Sidney Poitier played throughout his career?

In [160]:
n = titles[titles['name']=='Sidney Poitier']['character'].drop_duplicates().count()
print(f'Number of roles Sidney Poitier played throughout his career is: {n} ')

Number of roles Sidney Poitier played throughout his career is: 41

### How many roles has Judi Dench played?

In [116]:
n = titles[titles['name']=='Judi Dench']['character'].drop_duplicates().count()
print(f'Number of roles Judi Dench played throughout his career is: {n} ')

Number of roles Judi Dench played throughout his career is: 46

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [121]:
n = titles[(titles['name']=='Cary Grant') & (titles['n']==2)][['character','year']].drop_duplicates().sort_values('year')
print(f'Supporting roles played by Cary Grant are: ')
n.reset_index(drop=True)

Supporting roles played by Cary Grant are:

                    character  year
0   Lieutenant B.F. Pinkerton  1932
1            Captain Cummings  1933
2              Jeffrey Baxter  1933
3               Henry Crocker  1933
4                Jack Clayton  1933
5          Porter Madison III  1934
6              Malcolm Trevor  1934
7           Gerald Fitzgerald  1935
8                  Ken Gordon  1935
9               Jimmy Monkley  1936
10              Charlie Mason  1936
11               Jimmy Hudson  1937
12             Jerry Warriner  1937
13                  Nick Boyd  1937
14               George Kerby  1937
15                Johnny Case  1938
16                      David  1938
17                Alec Walker  1939
18                       Nick  1940
19                Roger Adams  1941

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [122]:
n = titles[(titles['name']=='Cary Grant') & (titles['n']==1) & (titles['year'] >=1940) & (titles['year'] <1950)][['character','year']].drop_duplicates().sort_values('year')
print(f'Lead roles played by Cary Grant are: ')
n.reset_index(drop=True)

Lead roles played by Cary Grant are:

                character  year
0             Matt Howard  1940
1            Walter Burns  1940
2      C. K. Dexter Haven  1940
3                 Johnnie  1941
4            Leopold Dilg  1942
5   Patrick 'Pat' O'Toole  1942
6           Capt. Cassidy  1943
7               Joe Adams  1943
8         Joe Bascopolous  1943
9             Jerry Flynn  1944
10      Mortimer Brewster  1944
11             Ernie Mott  1944
12            Cole Porter  1946
13                 Devlin  1946
14            Dick Nugent  1947
15                 Dudley  1947
16          Jim Blandings  1948
17      Dr. Madison Brown  1948
18  Captain Henri Rochard  1949

### How many roles were available for actors in the 1950s?

In [156]:
cnt = titles[(titles['year'] >= 1950 ) & (titles['year'] < 1960) & (titles['type']=='actor')]['character'].drop_duplicates().count()
print(f'Number of roles available for actors in the 1950s was: {cnt} ')

Number of roles available for actors in the 1950s was: 91786

### How many roles were available for actresses in the 1950s?

In [131]:
cnt = titles[(titles['year'] >= 1950 ) & (titles['year'] < 1960) & (titles['type']=='actress')]['character'].drop_duplicates().count()
print(f'Number of roles available for actress in the 1950s was: {cnt} ')

Number of roles available for actress in the 1950s was: 35432

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [155]:
ld_roles = titles[(titles['year'] <=1980 ) & (titles['n']==1)]['character'].drop_duplicates().count()
print(f'Number of leading roles available from the beginning of the film history through 1980 was: {ld_roles}')

Number of leading roles available from the beginning of the film history through 1980 was: 51200

### How many non-leading roles were available through from the beginning of film history through 1980?

In [154]:
ld_roles = titles[(titles['year'] <=1980 ) & (titles['n'] != 1)]['character'].drop_duplicates().count()
print(f'Number of non leading roles available from the beginning of the film history through 1980 was: {ld_roles}')

Number of non leading roles available from the beginning of the film history through 1980 was: 558711

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [153]:
n_cnt = titles[(titles['year'] <=1980 ) & (titles['n'].isna())]['character'].drop_duplicates().count()
print(f'Number of non leading roles with no numeric "n" through 1980 was: {n_cnt}')

Number of non leading roles with no numeric "n" through 1980 was: 186116